<a href="https://colab.research.google.com/github/912amanjeet/NamasteReact/blob/main/pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np

In [4]:
marks = [90,92,93,85,]

In [6]:
pd.Series(marks)

0    90
1    92
2    93
3    85
dtype: int64

In [7]:
subject=["Hindi","English","Maths","Sanskrit"]
pd.Series(marks,index=subject)

Hindi       90
English     92
Maths       93
Sanskrit    85
dtype: int64

Series Tuple

In [8]:
abc=(1,2,3,4)
pd.Series(abc)

0    1
1    2
2    3
3    4
dtype: int64

Series SET (we cant make series from set)

In [9]:
#series dict

In [10]:
marks={
    "Maths":98,
    "Physics":95,
    "Chemistry":67,
    "English":64,
    "Physical Education":78,
    "Computer Science":95
}

In [11]:
a=pd.Series(marks)

In [12]:
a

Maths                 98
Physics               95
Chemistry             67
English               64
Physical Education    78
Computer Science      95
dtype: int64

In [14]:
a["Maths"]

np.int64(98)

slicing and indexing

In [29]:
series=pd.Series((1,2,3,4,5,6,7,8,9,10,11,12,13,14),name="Aman")

In [30]:
series

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
Name: Aman, dtype: int64

In [31]:
series[5]

np.int64(6)

In [32]:
series[[1,5,12]]

1      2
5      6
12    13
Name: Aman, dtype: int64

In [33]:
series[1:10:2]

1     2
3     4
5     6
7     8
9    10
Name: Aman, dtype: int64

In [25]:
# series attribute

In [26]:
series.size

14

In [27]:
series.dtype

dtype('int64')

In [34]:
series.name

'Aman'

In [35]:
series.is_unique

True

In [36]:
series.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

In [37]:
a.index

Index(['Maths', 'Physics', 'Chemistry', 'English', 'Physical Education',
       'Computer Science'],
      dtype='object')

In [38]:
a

Maths                 98
Physics               95
Chemistry             67
English               64
Physical Education    78
Computer Science      95
dtype: int64

In [40]:
series.value_counts()

Aman
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
13    1
14    1
Name: count, dtype: int64

In [41]:
a["Maths"]=100

In [42]:
a

Maths                 100
Physics                95
Chemistry              67
English                64
Physical Education     78
Computer Science       95
dtype: int64

In [43]:
a["Music"]=90

In [44]:
a

Maths                 100
Physics                95
Chemistry              67
English                64
Physical Education     78
Computer Science       95
Music                  90
dtype: int64

In [45]:
a.drop("Music", inplace=True)

In [46]:
a

Maths                 100
Physics                95
Chemistry              67
English                64
Physical Education     78
Computer Science       95
dtype: int64

Arithmetic Operation

In [47]:
a+100

Maths                 200
Physics               195
Chemistry             167
English               164
Physical Education    178
Computer Science      195
dtype: int64

In [49]:
a[a>90]

Maths               100
Physics              95
Computer Science     95
dtype: int64